{"config": {"layers": [{"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dtype": "float32", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "activation": "linear", "filters": 32, "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "padding": "same", "name": "conv2d_1", "kernel_regularizer": null, "use_bias": true, "batch_input_shape": [null, 1, 128, 128], "strides": [1, 1], "kernel_constraint": null, "data_format": "channels_first"}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "name": "activation_1", "trainable": true}, "class_name": "Activation"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "filters": 32, "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "padding": "valid", "name": "conv2d_2", "kernel_regularizer": null, "use_bias": true, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "data_format": "channels_first"}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "name": "activation_2", "trainable": true}, "class_name": "Activation"}, {"config": {"padding": "valid", "name": "max_pooling2d_1", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "data_format": "channels_first"}, "class_name": "MaxPooling2D"}, {"config": {"seed": null, "trainable": true, "name": "dropout_1", "rate": 0.5, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "filters": 64, "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "padding": "valid", "name": "conv2d_3", "kernel_regularizer": null, "use_bias": true, "activation": "linear", "strides": [1, 1], "kernel_constraint": null, "data_format": "channels_first"}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "name": "activation_3", "trainable": true}, "class_name": "Activation"}, {"config": {"padding": "valid", "name": "max_pooling2d_2", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "data_format": "channels_first"}, "class_name": "MaxPooling2D"}, {"config": {"seed": null, "trainable": true, "name": "dropout_2", "rate": 0.5, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true, "data_format": "channels_first"}, "class_name": "Flatten"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 64, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "name": "dense_1", "kernel_regularizer": null, "use_bias": true, "activation": "linear", "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "name": "activation_4", "trainable": true}, "class_name": "Activation"}, {"config": {"seed": null, "trainable": true, "name": "dropout_3", "rate": 0.5, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 4, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "name": "dense_2", "kernel_regularizer": null, "use_bias": true, "activation": "linear", "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "softmax", "name": "activation_5", "trainable": true}, "class_name": "Activation"}], "name": "sequential_1"}, "class_name": "Sequential", "keras_version": "2.2.4", "backend": "tensorflow"}